## Pandas

In [185]:
import pandas as pd
import numpy as np

### Series Defination

In [186]:
serias = pd.Series([1,2,34]) #acts as python list
serias

0     1
1     2
2    34
dtype: int64

### DataFrame Defination

In [187]:
my_dict = {
    'Name':['alice','Bob','Charlie','Abdelrahman','youssef','fawzy','Seif'],
    'Age':[30,35,20,27,23,24,23],
    'City':['New York','Los Angeles','Chicago','cairo','Giza','cairo','cairo']
}
df = pd.DataFrame(my_dict)
df

          Name  Age         City
0        alice   30     New York
1          Bob   35  Los Angeles
2      Charlie   20      Chicago
3  Abdelrahman   27        cairo
4      youssef   23         Giza
5        fawzy   24        cairo
6         Seif   23        cairo

### Info Function

In [188]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Age     7 non-null      int64
 2   City    7 non-null      object
dtypes: int64(1), object(2)
memory usage: 296.0+ bytes

### Print first x rows or last x rows

In [189]:
df.head()

          Name  Age         City
0        alice   30     New York
1          Bob   35  Los Angeles
2      Charlie   20      Chicago
3  Abdelrahman   27        cairo
4      youssef   23         Giza

In [190]:
df.head(6)

          Name  Age         City
0        alice   30     New York
1          Bob   35  Los Angeles
2      Charlie   20      Chicago
3  Abdelrahman   27        cairo
4      youssef   23         Giza
5        fawzy   24        cairo

In [191]:
df.tail()

          Name  Age     City
2      Charlie   20  Chicago
3  Abdelrahman   27    cairo
4      youssef   23     Giza
5        fawzy   24    cairo
6         Seif   23    cairo

In [192]:
df.tail(6)

          Name  Age         City
1          Bob   35  Los Angeles
2      Charlie   20      Chicago
3  Abdelrahman   27        cairo
4      youssef   23         Giza
5        fawzy   24        cairo
6         Seif   23        cairo

### Get Some Numberic Info about data (Statistics of data)
#### used on numberic colomns

In [193]:
df.describe()

            Age
count   7.00000
mean   26.00000
std     5.09902
min    20.00000
25%    23.00000
50%    24.00000
75%    28.50000
max    35.00000

In [194]:
df.describe().T #Transpose (More Readable)

     count  mean      std   min   25%   50%   75%   max
Age    7.0  26.0  5.09902  20.0  23.0  24.0  28.5  35.0

### applying it to categorical cols also

In [195]:
df.describe(include='all').T

     count unique    top freq  mean      std   min   25%   50%   75%   max
Name     7      7  alice    1   NaN      NaN   NaN   NaN   NaN   NaN   NaN
Age    7.0    NaN    NaN  NaN  26.0  5.09902  20.0  23.0  24.0  28.5  35.0
City     7      5  cairo    3   NaN      NaN   NaN   NaN   NaN   NaN   NaN

### Accessing a specific Col

In [196]:
df['Age']

0    30
1    35
2    20
3    27
4    23
5    24
6    23
Name: Age, dtype: int64

In [197]:
df['Age'].head()

0    30
1    35
2    20
3    27
4    23
Name: Age, dtype: int64

In [198]:
df['City']

0       New York
1    Los Angeles
2        Chicago
3          cairo
4           Giza
5          cairo
6          cairo
Name: City, dtype: object

### Filtering Rows based on Condition
#### df[filter] this filter will be just return true or false that will be used to filter df

In [199]:
df[df['Age']>25]

          Name  Age         City
0        alice   30     New York
1          Bob   35  Los Angeles
3  Abdelrahman   27        cairo

In [200]:
df[df['City']=='cairo']

          Name  Age   City
3  Abdelrahman   27  cairo
5        fawzy   24  cairo
6         Seif   23  cairo

### Select a specific Colomns

In [201]:
df[['Age','City']]

   Age         City
0   30     New York
1   35  Los Angeles
2   20      Chicago
3   27        cairo
4   23         Giza
5   24        cairo
6   23        cairo

### .loc[] returns a specific rows and colomns that i want

In [202]:
df.loc[0:2,['Age','City']] # brings first 3 rows but only age and city cols needed

   Age         City
0   30     New York
1   35  Los Angeles
2   20      Chicago

In [203]:
df.loc[df['Age']>23,['Age','City']] # brings rows that follows a cond , but only age and city cols needed

   Age         City
0   30     New York
1   35  Los Angeles
3   27        cairo
5   24        cairo

### Adding a colomn in dataframe (Feature Engineering)

In [204]:
df['Salary']=[2000,3000,4000,5000,6000,7000,8000] #Just Like Dictionry style
#note the no of values must be = no of rows otherwise error (missing value)
df.head()

          Name  Age         City  Salary
0        alice   30     New York    2000
1          Bob   35  Los Angeles    3000
2      Charlie   20      Chicago    4000
3  Abdelrahman   27        cairo    5000
4      youssef   23         Giza    6000

### Updating A Colomn

In [205]:
df['Age'] = df['Age'] +1
df.head()

          Name  Age         City  Salary
0        alice   31     New York    2000
1          Bob   36  Los Angeles    3000
2      Charlie   21      Chicago    4000
3  Abdelrahman   28        cairo    5000
4      youssef   24         Giza    6000

### Drop (delete) a feature (Feature Selection Technique)

In [206]:
df.drop('Salary',axis=1) ## axis here to say we are droping a feature or a row axis = 1 == y-axis 
#note this edits a copy and returns it  not original df (original df still has salary colomn)

          Name  Age         City
0        alice   31     New York
1          Bob   36  Los Angeles
2      Charlie   21      Chicago
3  Abdelrahman   28        cairo
4      youssef   24         Giza
5        fawzy   25        cairo
6         Seif   24        cairo

In [207]:
df.drop('Salary',axis=1,inplace=True) ## == newdf=df.drop('Salary',axis=1,inplace=True)
## Edits original dataframe not a copy
df

          Name  Age         City
0        alice   31     New York
1          Bob   36  Los Angeles
2      Charlie   21      Chicago
3  Abdelrahman   28        cairo
4      youssef   24         Giza
5        fawzy   25        cairo
6         Seif   24        cairo

### Drop A Row

In [208]:
df.drop(2,axis=0)
# problem is that index isn't ok reset it

          Name  Age         City
0        alice   31     New York
1          Bob   36  Los Angeles
3  Abdelrahman   28        cairo
4      youssef   24         Giza
5        fawzy   25        cairo
6         Seif   24        cairo

In [209]:
df.reset_index(inplace=True)
df

   index         Name  Age         City
0      0        alice   31     New York
1      1          Bob   36  Los Angeles
2      2      Charlie   21      Chicago
3      3  Abdelrahman   28        cairo
4      4      youssef   24         Giza
5      5        fawzy   25        cairo
6      6         Seif   24        cairo

### Null-Values Handling

In [210]:
my_dict2 = {
    'Name':['alice','Bob','Charlie','Abdelrahman','youssef','fawzy',None],
    'Age':[30,35,20,27,23,None,23],
    'City':['New York','Los Angeles',None,'cairo','Giza','cairo','cairo']
}
df2 = pd.DataFrame(my_dict2)
df2

          Name   Age         City
0        alice  30.0     New York
1          Bob  35.0  Los Angeles
2      Charlie  20.0         None
3  Abdelrahman  27.0        cairo
4      youssef  23.0         Giza
5        fawzy   NaN        cairo
6         None  23.0        cairo

### Detect Null Values

In [211]:
df2.isnull()

    Name    Age   City
0  False  False  False
1  False  False  False
2  False  False   True
3  False  False  False
4  False  False  False
5  False   True  False
6   True  False  False

In [212]:
df2.isnull().sum() # More interpretable

Name    1
Age     1
City    1
dtype: int64

### Fill Null Values

In [213]:
df2['City'].fillna(" ",inplace=False) # Fill with empty String

0       New York
1    Los Angeles
2
3          cairo
4           Giza
5          cairo
6          cairo
Name: City, dtype: object

In [214]:
df2['City'].fillna(df['City'].mode()[0],inplace=False) # Fill with empty String
## mode() returns a list of most repeated value so we take first element example [cairo=5,alexanderia=5] take anyone we will take cairo iindex=0

0       New York
1    Los Angeles
2          cairo
3          cairo
4           Giza
5          cairo
6          cairo
Name: City, dtype: object

In [215]:
print(df2['Age'])
df2['Age'].fillna(int(df2['Age'].mean()),inplace=False)

0    30.0
1    35.0
2    20.0
3    27.0
4    23.0
5     NaN
6    23.0
Name: Age, dtype: float64

0    30.0
1    35.0
2    20.0
3    27.0
4    23.0
5    26.0
6    23.0
Name: Age, dtype: float64

### Drop Null Values

In [216]:
df2.dropna(inplace=False) #Drop any row that has a null value in it

          Name   Age         City
0        alice  30.0     New York
1          Bob  35.0  Los Angeles
3  Abdelrahman  27.0        cairo
4      youssef  23.0         Giza

In [217]:
df2['Age'].dropna(inplace=False) # Drop only rows that has "Age' is NULL

0    30.0
1    35.0
2    20.0
3    27.0
4    23.0
6    23.0
Name: Age, dtype: float64

### all the previous i was doing inplace = False ( Because i don't want original df to be affected)
#### now lets do inplace to count the nulls

In [218]:
df2.dropna(inplace=True)
print(df2.isnull().sum())
print("\n")
print(df2.info())

Name    0
Age     0
City    0
dtype: int64


<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      object
 1   Age     4 non-null      float64
 2   City    4 non-null      object
dtypes: float64(1), object(2)
memory usage: 128.0+ bytes
None

## Groupby() group rows based on a condition

In [219]:
my_dict3 = {
    'Name':['alice','Bob','Charlie','Abdelrahman','youssef','fawzy','Seif'],
    'Age':[30,35,20,27,23,24,23],
    'City':['New York','Los Angeles','Chicago','Giza','Giza','cairo','cairo'],
    'Salary':[2000,3000,4000,5000,6000,7000,8000]
}
df3 = pd.DataFrame(my_dict3)
df3

          Name  Age         City  Salary
0        alice   30     New York    2000
1          Bob   35  Los Angeles    3000
2      Charlie   20      Chicago    4000
3  Abdelrahman   27         Giza    5000
4      youssef   23         Giza    6000
5        fawzy   24        cairo    7000
6         Seif   23        cairo    8000

In [220]:
df3.groupby(by='City')['Age'].mean() #Group by city then for each group calculate mean of age

City
Chicago        20.0
Giza           25.0
Los Angeles    35.0
New York       30.0
cairo          23.5
Name: Age, dtype: float64

## Apply Function for a Colomn (Feature)

In [221]:
def double_salary(salary):
    return salary*2

df3['Double_Salary'] = df3['Salary'].apply(double_salary) # Create new colomn by applying function to existing colomn
df3

          Name  Age         City  Salary  Double_Salary
0        alice   30     New York    2000           4000
1          Bob   35  Los Angeles    3000           6000
2      Charlie   20      Chicago    4000           8000
3  Abdelrahman   27         Giza    5000          10000
4      youssef   23         Giza    6000          12000
5        fawzy   24        cairo    7000          14000
6         Seif   23        cairo    8000          16000

### Apply Lambda Function

In [222]:
df3['Double_SalaryLambda'] = df3['Salary'].apply(lambda x: x*2) # Using lambda function to do the same
df3

          Name  Age         City  Salary  Double_Salary  Double_SalaryLambda
0        alice   30     New York    2000           4000                 4000
1          Bob   35  Los Angeles    3000           6000                 6000
2      Charlie   20      Chicago    4000           8000                 8000
3  Abdelrahman   27         Giza    5000          10000                10000
4      youssef   23         Giza    6000          12000                12000
5        fawzy   24        cairo    7000          14000                14000
6         Seif   23        cairo    8000          16000                16000

# Real practical Lab (Submission)

### Read CSV File and parse it into DataFrame

In [223]:
data=pd.read_csv('employees.csv')
data.head()

   ID           Name Department  Age  Salary Joining_Date
0   1       John Doe         HR   28   50000   2020-05-21
1   2     Jane Smith         IT   34   75000   2019-06-12
2   3    Bob Johnson    Finance   45   85000   2018-07-15
3   4    Alice White         IT   29   72000   2021-01-04
4   5  Charlie Brown  Marketing   32   68000   2019-11-30

### Display Basic Information of dataframe

In [224]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   ID            10 non-null     int64
 1   Name          10 non-null     object
 2   Department    10 non-null     object
 3   Age           10 non-null     int64
 4   Salary        10 non-null     int64
 5   Joining_Date  10 non-null     object
dtypes: int64(3), object(3)
memory usage: 608.0+ bytes

### Obtain Basic Statistics for Numberical Columns

In [225]:
data.describe().T # Shows the statistics for numberical only

,count,mean,std,min,25%,50%,75%,max
ID,10.0,5.5,3.027650,1.0,3.25,5.5,7.75,10.0
Age,10.0,35.3,7.958922,26.0,29.25,33.0,40.25,50.0
Salary,10.0,68300.0,13106.826042,50000.0,57250.00,69000.0,74250.00,90000.0

### Filtering Employees By department

In [226]:
data[data['Department'] == 'IT'] ## Prints all employees that has a department field == IT

   ID          Name Department  Age  Salary Joining_Date
1   2    Jane Smith         IT   34   75000   2019-06-12
3   4   Alice White         IT   29   72000   2021-01-04
7   8  Linda Taylor         IT   26   64000   2022-02-10

### Calculate Average Salary by department

In [227]:
data.groupby('Department')['Salary'].mean()

Department
Finance      87500.000000
HR           53000.000000
IT           70333.333333
Marketing    69000.000000
Name: Salary, dtype: float64

### Adding a New Coloumn for Salary after a 5% Raise

In [228]:
data['newSalary'] = data['Salary'] * 1.05
data

   ID           Name Department  Age  Salary Joining_Date  newSalary
0   1       John Doe         HR   28   50000   2020-05-21    52500.0
1   2     Jane Smith         IT   34   75000   2019-06-12    78750.0
2   3    Bob Johnson    Finance   45   85000   2018-07-15    89250.0
3   4    Alice White         IT   29   72000   2021-01-04    75600.0
4   5  Charlie Brown  Marketing   32   68000   2019-11-30    71400.0
5   6      Eva Green         HR   41   54000   2017-04-22    56700.0
6   7     Mike Davis    Finance   50   90000   2016-08-19    94500.0
7   8   Linda Taylor         IT   26   64000   2022-02-10    67200.0
8   9   James Wilson  Marketing   38   70000   2020-09-08    73500.0
9  10    Sarah Adams         HR   30   55000   2021-03-18    57750.0

### Sort Rows by age

In [229]:
dataCopy = data.sort_values('Age',ascending=False,inplace=False) # by default Ascending
dataCopy

   ID           Name Department  Age  Salary Joining_Date  newSalary
6   7     Mike Davis    Finance   50   90000   2016-08-19    94500.0
2   3    Bob Johnson    Finance   45   85000   2018-07-15    89250.0
5   6      Eva Green         HR   41   54000   2017-04-22    56700.0
8   9   James Wilson  Marketing   38   70000   2020-09-08    73500.0
1   2     Jane Smith         IT   34   75000   2019-06-12    78750.0
4   5  Charlie Brown  Marketing   32   68000   2019-11-30    71400.0
9  10    Sarah Adams         HR   30   55000   2021-03-18    57750.0
3   4    Alice White         IT   29   72000   2021-01-04    75600.0
0   1       John Doe         HR   28   50000   2020-05-21    52500.0
7   8   Linda Taylor         IT   26   64000   2022-02-10    67200.0

### Obtain no of employees in each department

In [230]:
data['Department'].value_counts() # count occurance of each department values in rows

Department
HR           3
IT           3
Finance      2
Marketing    2
Name: count, dtype: int64

### Obtain employes that joined after 2020

In [231]:
data['Joining_Date']=pd.to_datetime(data['Joining_Date']) # to_datetime transfers date to standard datetime format
data

   ID           Name Department  Age  Salary Joining_Date  newSalary
0   1       John Doe         HR   28   50000   2020-05-21    52500.0
1   2     Jane Smith         IT   34   75000   2019-06-12    78750.0
2   3    Bob Johnson    Finance   45   85000   2018-07-15    89250.0
3   4    Alice White         IT   29   72000   2021-01-04    75600.0
4   5  Charlie Brown  Marketing   32   68000   2019-11-30    71400.0
5   6      Eva Green         HR   41   54000   2017-04-22    56700.0
6   7     Mike Davis    Finance   50   90000   2016-08-19    94500.0
7   8   Linda Taylor         IT   26   64000   2022-02-10    67200.0
8   9   James Wilson  Marketing   38   70000   2020-09-08    73500.0
9  10    Sarah Adams         HR   30   55000   2021-03-18    57750.0

In [232]:
data[data['Joining_Date'] > "2020-01-01"]

   ID          Name Department  Age  Salary Joining_Date  newSalary
0   1      John Doe         HR   28   50000   2020-05-21    52500.0
3   4   Alice White         IT   29   72000   2021-01-04    75600.0
7   8  Linda Taylor         IT   26   64000   2022-02-10    67200.0
8   9  James Wilson  Marketing   38   70000   2020-09-08    73500.0
9  10   Sarah Adams         HR   30   55000   2021-03-18    57750.0

### Save Preproccesed Data

In [233]:
data.to_csv('Preprocessed_employees.csv')